Revit 2024 API
NumericRevisionSettings Properties
The NumericRevisionSettings type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MinimumDigits
 Controls the minimum number of digits for a revision number.
Prefix
 The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType.
StartNumber
 The start number for the sequence.
Suffix
 The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType.
See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace